hdfixi/mxrt1040-drivers-exploration/MIMXRT1040_Project_cmsis_lpuart_interrupt_transfer/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_13 (coord J11), UART1_RXD/J11[2] */
/* Routed pin properties */
#define LPUART1_INITPINS_UART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define LPUART1_INITPINS_UART1_RXD_SIGNAL                                     RX   /*!< Signal name */

/* GPIO_AD_B0_12 (coord J12), UART1_TXD/J13[2] */
/* Routed pin properties */
#define LPUART1_INITPINS_UART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define LPUART1_INITPINS_UART1_TXD_SIGNAL                                     TX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART1_InitPins(void);

#define LPUART1_DEINITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x3000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B0_12 (coord J12), UART1_TXD/J13[2] */
/* Routed pin properties */
#define LPUART1_DEINITPINS_UART1_TXD_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define LPUART1_DEINITPINS_UART1_TXD_SIGNAL                              gpio_io   /*!< Signal name */
#define LPUART1_DEINITPINS_UART1_TXD_CHANNEL                                 12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPUART1_DEINITPINS_UART1_TXD_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_TXD_GPIO_PIN                                12U   /*!< GPIO pin number */
#define LPUART1_DEINITPINS_UART1_TXD_GPIO_PIN_MASK                   (1U << 12U)   /*!< GPIO pin mask */
#define LPUART1_DEINITPINS_UART1_TXD_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_TXD_PIN                                     12U   /*!< PORT pin number */
#define LPUART1_DEINITPINS_UART1_TXD_PIN_MASK                        (1U << 12U)   /*!< PORT pin mask */

/* GPIO_AD_B0_13 (coord J11), UART1_RXD/J11[2] */
/* Routed pin properties */
#define LPUART1_DEINITPINS_UART1_RXD_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define LPUART1_DEINITPINS_UART1_RXD_SIGNAL                              gpio_io   /*!< Signal name */
#define LPUART1_DEINITPINS_UART1_RXD_CHANNEL                                 13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPUART1_DEINITPINS_UART1_RXD_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_RXD_GPIO_PIN                                13U   /*!< GPIO pin number */
#define LPUART1_DEINITPINS_UART1_RXD_GPIO_PIN_MASK                   (1U << 13U)   /*!< GPIO pin mask */
#define LPUART1_DEINITPINS_UART1_RXD_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_RXD_PIN                                     13U   /*!< PORT pin number */
#define LPUART1_DEINITPINS_UART1_RXD_PIN_MASK                        (1U << 13U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART1_DeinitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
